In [9]:
import pandas as pd
import numpy as np
from typing import List, Optional

In [10]:
mentor_df = pd.read_csv('../../data/Mentors.csv')
staff_df = pd.read_csv('../../data/Staff.csv')
meeting_1 = pd.read_excel('../../data/2025-07-29 17_45 wrt-nsga-feo Attendance Report.xlsx')
meeting_2 = pd.read_excel('../../data/2025-07-30 17_50 kan-ptwt-ehz Attendance Report.xlsx')

In [11]:
mentor_df

    First Name   Last Name  Alternate Name
0         Alex           D             NaN
1     Annaleya    Hamilton             NaN
2       Austin     Reading             NaN
3      Barbara      Adkins             NaN
4         Bill  Montgomery             NaN
5        Blare    Robinson             NaN
6        Chris    Metcalfe  Chris Metcalfe
7       Chris       Kaelin             NaN
8    Christina      Porter             NaN
9         Cody      Miller             NaN
10       Craig        Geil             NaN
11     David      Brundage             NaN
12     David        Dieruf             NaN
13   Elizabeth      George             NaN
14   Elizabeth        Hahn             NaN
15    Euclides       Vezga             NaN
16        Jake  St Germain             NaN
17        Jake      Sexton             NaN
18        John      Stokes             NaN
19      Justin   Schuhmann             NaN
20         Ken    Quiggins    ken quiggins
21    Lawrence      Caudle             NaN
22         Liz        Hahn             NaN
23        Matt      Harvey             NaN
24        Matt      Deshon             NaN
25     Michael     Puckett             NaN
26   Mostafa        Nabieh             NaN
27        Nick    Swinford             NaN
28     Radmila         NaN             NaN
29        Rama    Kattunga             NaN
30       Reddy    Praveena             NaN
31      Robert        York             NaN
32      Ryan      Thompson             NaN
33  Saravanan      Murugan             NaN
34   Sebastian       Frohm             NaN
35       Sunny      Zanchi             NaN

In [12]:
staff_df

   First Name Last name  Alternate Name  Email  Region
0      Ailene  Johnston             NaN    NaN     NaN
1        Alli     Rippy             NaN    NaN     NaN
2     Amanda   Gearhart             NaN    NaN     NaN
3      August      Mapp             NaN    NaN     NaN
4       Blake   Herbert             NaN    NaN     NaN
5      Brian    Luerman             NaN    NaN     NaN
6   classroom     admin             NaN    NaN     NaN
7         Dan   Collins             NaN    NaN     NaN
8       Danny    Morton             NaN    NaN     NaN
9       David      York             NaN    NaN     NaN
10      Emily  Sullivan             NaN    NaN     NaN
11      Jared   Mueller             NaN    NaN     NaN
12      Jenny     Terry             NaN    NaN     NaN
13      Kalee    Howard             NaN    NaN     NaN
14     Rekkai     Steed             NaN    NaN     NaN
15    Shannon    Sheehy             NaN    NaN     NaN
16      Tonia    Nolden             NaN    NaN     NaN

In [13]:
def keep_name(df: pd.DataFrame) -> pd.DataFrame:
    """
    Titles columns in a DataFrame and drops all other columns that is not the 'First Name' and 'Last Name'.

    Args:
        df (pd.DataFrame): A data frame containing at least 'First Name' and 'Last Name' columns.

    Returns:
        pd.DataFrame: A Data Frame with only the 'First Name' and 'Last Name' Columns
    """
    df.columns = df.columns.str.title()
    df['First Name'] = df['First Name'].str.title()
    df['Last Name'] = df['Last Name'].str.title()
    col_to_keep = ['First Name', 'Last Name']
    return df[col_to_keep].copy()

In [14]:
def process_meeting_times(df: pd.DataFrame) -> pd.DataFrame:
    """
    Standardize meeting time columns and calculate duration.

    Steps performed:
    1. Converts 'Time Joined' and 'Time Exited' columns to datetime objects.
    2. Calculates the meeting duration in minutes and stores it in 'Duration in Minutes'.

    Parameters
    ----------
    df : pd.DataFrame
        DataFrame containing meeting data with 'Time Joined' and 'Time Exited' columns.

    Returns
    -------
    pd.DataFrame
        Updated DataFrame with time columns as datetime and a duration column.
    """
    df.columns = df.columns.str.title()
    df['Time Joined'] = pd.to_datetime(df['Time Joined'], format='%I:%M %p', errors='coerce')
    df['Time Exited'] = pd.to_datetime(df['Time Exited'], format='%I:%M %p', errors='coerce')
    df['Duration In Minutes'] = (
        df['Time Exited'] - df['Time Joined']
    ).dt.total_seconds() / 60
    return df


def add_full_name(df: pd.DataFrame) -> pd.DataFrame:
    """
    Add a 'Full Name' column by combining 'First Name' and 'Last Name'.

    Parameters
    ----------
    df : pd.DataFrame
        DataFrame containing 'First Name' and 'Last Name' columns.

    Returns
    -------
    pd.DataFrame
        DataFrame with a new 'Full Name' column.
    """
    df['Full Name'] = df['First Name'].str.title() + ' ' + df['Last Name'].str.title()
    return df

In [15]:
def split_names(df: pd.DataFrame) -> pd.DataFrame:
    """Function accounting for instance where first name column contains more than just the first name

    Args:
        df (pd.DataFrame): DataFrame that needs to be checked for more than one name in first name

    Returns:
        pd.DataFrame: DataFrame containing only the first name in the first name column and fills the last name column with the last name
    """
    if ' ' in df['First Name']:
        names = df['First Name'].split()
        if len(names) >= 2:
            df['First Name'] = names[0]
            df['Last Name'] = names[-1]
    return df

In [16]:
def clean_name_df(df: pd.DataFrame) -> pd.DataFrame:
    """
    Clean and standardize names for a DataFrame.

    Steps performed:
    1. Capitalizes column names for consistency.
    2. Drops all comlumns that are not 'Fist Name' or 'Last Name'
    3. Fill null values in name columns.
    4. Accounts for instance where 'First Name' contains 'Last Name'
    5. Creates a 'Full Name' column by combining 'First Name' and 'Last Name'.

    Parameters
    ----------
    df : pd.DataFrame
        Input DataFrame containing name data.

    Returns
    -------
    pd.DataFrame
        A cleaned DataFrame with standardized columns and a 'Full Name' field.
    """
    df = keep_name(df)
    if df.isna().any().any() == True:
        df = df.fillna('Unknown')
    df = df.apply(split_names, 1)    
    df = add_full_name(df)

    return df

Gives us info on the function from the doc string

In [17]:
clean_name_df?

Signature: clean_name_df(df: pandas.core.frame.DataFrame) -> pandas.core.frame.DataFrame
Docstring:
Clean and standardize names for a DataFrame.

Steps performed:
1. Capitalizes column names for consistency.
2. Drops all comlumns that are not 'Fist Name' or 'Last Name'
3. Fill null values in name columns.
4. Accounts for instance where 'First Name' contains 'Last Name'
5. Creates a 'Full Name' column by combining 'First Name' and 'Last Name'.

Parameters
----------
df : pd.DataFrame
    Input DataFrame containing name data.

Returns
-------
pd.DataFrame
    A cleaned DataFrame with standardized columns and a 'Full Name' field.
File:      c:\users\leolion023\appdata\local\temp\ipykernel_123176\4077920601.py
Type:      function

In [18]:
staff_list = clean_name_df(staff_df)
staff_list

   First Name Last Name         Full Name
0      Ailene  Johnston   Ailene Johnston
1        Alli     Rippy        Alli Rippy
2     Amanda   Gearhart  Amanda  Gearhart
3      August      Mapp       August Mapp
4       Blake   Herbert     Blake Herbert
5      Brian    Luerman    Brian  Luerman
6   Classroom     Admin   Classroom Admin
7         Dan   Collins       Dan Collins
8       Danny    Morton      Danny Morton
9       David      York        David York
10      Emily  Sullivan    Emily Sullivan
11      Jared   Mueller     Jared Mueller
12      Jenny     Terry       Jenny Terry
13      Kalee    Howard      Kalee Howard
14     Rekkai     Steed      Rekkai Steed
15    Shannon    Sheehy    Shannon Sheehy
16      Tonia    Nolden      Tonia Nolden

In [19]:
##clean_mentor_df?

In [20]:
mentor_list = clean_name_df(mentor_df)
mentor_list

    First Name   Last Name           Full Name
0         Alex           D              Alex D
1     Annaleya    Hamilton   Annaleya Hamilton
2       Austin     Reading      Austin Reading
3      Barbara      Adkins      Barbara Adkins
4         Bill  Montgomery     Bill Montgomery
5        Blare    Robinson      Blare Robinson
6        Chris    Metcalfe      Chris Metcalfe
7       Chris       Kaelin       Chris  Kaelin
8    Christina      Porter    Christina Porter
9         Cody      Miller         Cody Miller
10       Craig        Geil          Craig Geil
11     David      Brundage    David   Brundage
12     David        Dieruf      David   Dieruf
13   Elizabeth      George    Elizabeth George
14   Elizabeth        Hahn      Elizabeth Hahn
15    Euclides       Vezga      Euclides Vezga
16        Jake  St Germain     Jake St Germain
17        Jake      Sexton         Jake Sexton
18        John      Stokes         John Stokes
19      Justin   Schuhmann    Justin Schuhmann
20         Ken    Quiggins        Ken Quiggins
21    Lawrence      Caudle     Lawrence Caudle
22         Liz        Hahn            Liz Hahn
23        Matt      Harvey         Matt Harvey
24        Matt      Deshon         Matt Deshon
25     Michael     Puckett     Michael Puckett
26   Mostafa        Nabieh    Mostafa   Nabieh
27        Nick    Swinford       Nick Swinford
28     Radmila     Unknown     Radmila Unknown
29        Rama    Kattunga       Rama Kattunga
30       Reddy    Praveena      Reddy Praveena
31      Robert        York         Robert York
32      Ryan      Thompson     Ryan   Thompson
33  Saravanan      Murugan  Saravanan  Murugan
34   Sebastian       Frohm     Sebastian Frohm
35       Sunny      Zanchi        Sunny Zanchi

In [21]:
meeting_1

,First name,Last name,Email,Duration,Time joined,Time exited
0,Alex,D,awda*****@***.com,2 hr 25 min,6:01 PM,8:26 PM
1,Angela,Moore,ange*************@***.com,2 hr 29 min,5:59 PM,8:27 PM
2,Bill,Montgomery,kyho***@***.com,2 hr 27 min,5:59 PM,8:26 PM
3,Charles,Norman,ario****@***.com,2 hr 42 min,5:45 PM,8:27 PM
4,Christina,Porter,chri**************@***.com,2 hr 4 min,6:15 PM,8:19 PM
5,Cindy,Wedding,cwed*******@***.com,2 hr 22 min,6:03 PM,8:25 PM
6,Classroom,Admin,classroom@codeyou.org,1 min,5:59 PM,6:00 PM
7,Joel,Anderson,joel*************@***.com,2 hr 27 min,6:00 PM,8:27 PM
8,Jonathan,Chadwell,jona*******************@***.com,2 hr 24 min,6:02 PM,8:26 PM
9,Mendell,M,menm****@***.com,1 hr 58 min,6:00 PM,8:00 PM
10,Oli,Ivanova,olga************@***.com,2 hr 14 min,5:59 PM,8:13 PM
11,S.,Byrnes,smby***@***.com,1 hr 58 min,6:02 PM,8:00 PM
12,Tara Leigh,Hylton,turr******@***.com,2 hr 5 min,6:01 PM,8:06 PM
13,Whitney,Parks,wypa*****@***.com,2 hr 38 min,6:01 PM,8:39 PM
14,Zachary,Young,zach*************@***.com,2 hr 6 min,5:54 PM,8:00 PM
15,Zhenzhen,Xie,xzz.**********@***.com,2 hr 24 min,6:01 PM,8:26 PM

In [22]:
test = process_meeting_times(meeting_1)
test = add_full_name(test)
test

,First Name,Last Name,Email,Duration,Time Joined,Time Exited,Duration In Minutes,Full Name
0,Alex,D,awda*****@***.com,2 hr 25 min,1900-01-01 18:01:00,1900-01-01 20:26:00,145.0,Alex D
1,Angela,Moore,ange*************@***.com,2 hr 29 min,1900-01-01 17:59:00,1900-01-01 20:27:00,148.0,Angela Moore
2,Bill,Montgomery,kyho***@***.com,2 hr 27 min,1900-01-01 17:59:00,1900-01-01 20:26:00,147.0,Bill Montgomery
3,Charles,Norman,ario****@***.com,2 hr 42 min,1900-01-01 17:45:00,1900-01-01 20:27:00,162.0,Charles Norman
4,Christina,Porter,chri**************@***.com,2 hr 4 min,1900-01-01 18:15:00,1900-01-01 20:19:00,124.0,Christina Porter
5,Cindy,Wedding,cwed*******@***.com,2 hr 22 min,1900-01-01 18:03:00,1900-01-01 20:25:00,142.0,Cindy Wedding
6,Classroom,Admin,classroom@codeyou.org,1 min,1900-01-01 17:59:00,1900-01-01 18:00:00,1.0,Classroom Admin
7,Joel,Anderson,joel*************@***.com,2 hr 27 min,1900-01-01 18:00:00,1900-01-01 20:27:00,147.0,Joel Anderson
8,Jonathan,Chadwell,jona*******************@***.com,2 hr 24 min,1900-01-01 18:02:00,1900-01-01 20:26:00,144.0,Jonathan Chadwell
9,Mendell,M,menm****@***.com,1 hr 58 min,1900-01-01 18:00:00,1900-01-01 20:00:00,120.0,Mendell M
10,Oli,Ivanova,olga************@***.com,2 hr 14 min,1900-01-01 17:59:00,1900-01-01 20:13:00,134.0,Oli Ivanova
11,S.,Byrnes,smby***@***.com,1 hr 58 min,1900-01-01 18:02:00,1900-01-01 20:00:00,118.0,S. Byrnes
12,Tara Leigh,Hylton,turr******@***.com,2 hr 5 min,1900-01-01 18:01:00,1900-01-01 20:06:00,125.0,Tara Leigh Hylton
13,Whitney,Parks,wypa*****@***.com,2 hr 38 min,1900-01-01 18:01:00,1900-01-01 20:39:00,158.0,Whitney Parks
14,Zachary,Young,zach*************@***.com,2 hr 6 min,1900-01-01 17:54:00,1900-01-01 20:00:00,126.0,Zachary Young
15,Zhenzhen,Xie,xzz.**********@***.com,2 hr 24 min,1900-01-01 18:01:00,1900-01-01 20:26:00,145.0,Zhenzhen Xie

In [23]:
def clean_meeting(df: pd.DataFrame) -> pd.DataFrame:
    df = process_meeting_times(df)
    df = add_full_name(df)
    col_to_keep = ['Full Name', 'Duration In Minutes']
    return df[col_to_keep].copy()

In [24]:
meeting_1_cleaned = clean_meeting(meeting_1)
meeting_1_cleaned

            Full Name  Duration In Minutes
0              Alex D                145.0
1        Angela Moore                148.0
2     Bill Montgomery                147.0
3      Charles Norman                162.0
4    Christina Porter                124.0
5       Cindy Wedding                142.0
6     Classroom Admin                  1.0
7       Joel Anderson                147.0
8   Jonathan Chadwell                144.0
9           Mendell M                120.0
10        Oli Ivanova                134.0
11          S. Byrnes                118.0
12  Tara Leigh Hylton                125.0
13      Whitney Parks                158.0
14      Zachary Young                126.0
15       Zhenzhen Xie                145.0

In [25]:
def match_meeting_times(clean_list: pd.DataFrame,clean_meeting_time: pd.DataFrame) -> pd.DataFrame:
    """
    Merges two DataFrame containing the name and duration of members that were present for a meeting.

    Args:
        clean_list (pd.DataFrame): A DataFrame containing the 'Full Name' column.
        clean_meeting_time (pd.DataFrame): A DataFrame containing 'Duration in Minutes' and 'Full Name' columns.

    Returns:
        pd.DataFrame: A DataFrame containing the 'Full Name' and 'Duration in Minutes' columns.
    """
    df = pd.merge(clean_list['Full Name'],clean_meeting_time[['Duration In Minutes','Full Name']], how = 'inner',on='Full Name')
    return df

In [26]:
meeting_1_cleaned.columns

Index(['Full Name', 'Duration In Minutes'], dtype='object')

In [27]:
#merge meeting 1 with mentor list to consolidate into list of mentors that where present and how long they where present
mentor_time = match_meeting_times(mentor_list,meeting_1_cleaned)
mentor_time

          Full Name  Duration In Minutes
0            Alex D                145.0
1   Bill Montgomery                147.0
2  Christina Porter                124.0

In [28]:
#merge staff 1 with mentor list to consolidate into list of staff that where present and how long they where present
staff_time = match_meeting_times(staff_list,meeting_1_cleaned)
staff_time

         Full Name  Duration In Minutes
0  Classroom Admin                  1.0

In [29]:
meeting_2_cleaned = clean_meeting(meeting_2)
meeting_2_cleaned

           Full Name  Duration In Minutes
0        Sheyla Diaz                103.0
1      James Glosser                100.0
2        Reed Haddix                106.0
3       John Hankins                 98.0
4    Stephanie Jones                108.0
5    Aaron Laliberty                 99.0
6    Dakota Mcmullin                 72.0
7     Toni-Ivy Ownn.                100.0
8    Michael Puckett                 97.0
9   Leighton Pulliam                101.0
10      Ken Quiggins                103.0
11     Amber Ratliff                100.0
12      Jill Schrank                102.0
13         Huan Song                103.0

In [30]:
#merge meeting 2 with mentor list to consolidate into list of mentors that where present and how long they where present
mentor_time_2 = match_meeting_times(mentor_list,meeting_2_cleaned)
mentor_time_2

         Full Name  Duration In Minutes
0     Ken Quiggins                103.0
1  Michael Puckett                 97.0

In [31]:
#merge meeting 2 with staff list to consolidate into list of staff that where present and how long they where present
staff_time_2 = match_meeting_times(staff_list,meeting_2_cleaned)
staff_time_2

Empty DataFrame
Columns: [Full Name, Duration In Minutes]
Index: []

In [32]:
def remove_staff_mentor_meeting(meeting: pd.DataFrame, staff_list: pd.DataFrame, mentor_list: pd.DataFrame) -> pd.DataFrame:
    """
        Removes staff and mentor names from the meeting list
    Args:
        meeting (pd.DataFrame): meeting being reduced
        staff_list (pd.DataFrame): list of staff names
        mentor_list (pd.DataFrame): list of mentor names

    Returns:
        pd.DataFrame: list of members and time duration excluding staff and mentor names
    """
    df = meeting[~meeting['Full Name'].isin(mentor_list['Full Name'])]
    df = df[~df['Full Name'].isin(staff_list['Full Name'])]
    return df

In [33]:
meeting_1_students = remove_staff_mentor_meeting(meeting_1_cleaned,staff_list,mentor_list)
meeting_1_students

            Full Name  Duration In Minutes
1        Angela Moore                148.0
3      Charles Norman                162.0
5       Cindy Wedding                142.0
7       Joel Anderson                147.0
8   Jonathan Chadwell                144.0
9           Mendell M                120.0
10        Oli Ivanova                134.0
11          S. Byrnes                118.0
12  Tara Leigh Hylton                125.0
13      Whitney Parks                158.0
14      Zachary Young                126.0
15       Zhenzhen Xie                145.0

In [34]:
meeting_2_students = remove_staff_mentor_meeting(meeting_2_cleaned,staff_list,mentor_list)
meeting_2_students

           Full Name  Duration In Minutes
0        Sheyla Diaz                103.0
1      James Glosser                100.0
2        Reed Haddix                106.0
3       John Hankins                 98.0
4    Stephanie Jones                108.0
5    Aaron Laliberty                 99.0
6    Dakota Mcmullin                 72.0
7     Toni-Ivy Ownn.                100.0
9   Leighton Pulliam                101.0
11     Amber Ratliff                100.0
12      Jill Schrank                102.0
13         Huan Song                103.0